package com.ohgiraffers.polymorphism.run;

public class Run {

    public static void main(String[] args) {

        /* <readme>
        1. 시트템 요구사항
        1) 사용자는 점의 좌표값과 원의 반지름을 입력할 수 있다.
        2) 프로그램은 좌표값을 입력받아 길이, 둘레, 넓이을 계산할 수 있다.
        3) 사용자는 프로그램을 실행시 1. 점, 2. 선, 3. 면, 프로그램 종료 중 하나를 선택할 수 있다.
        4) 1. 점 선택시 점의 좌표값을 입력하고 출력한다.
        5) 2. 선 선택시 점 2개의 좌표값을 입력하라는 문구가 뜨고 입력하면 좌표값들과 길이값이 계산되어 출력된다.
        6) 3. 면 선택시 도형을 선택 할 수 있고 선택한 도형이 요구하는 값을 입력하면 좌표값들과 둘레와 넓이 값이 계산되어 출력된다.
        7) 프로그램 종료를 선택하면 정말 종료하시겠습니까? 란 문구가 뜨고 프로그램이 종료된다.
        8) 좌표 값을 입력받아 해당하는 값들이 출력 되고 난 후 프로그램을 종료할지 말지 문구가 출력되고 종료를 원하지 않다면
           프로그램 초기 메뉴로 돌아가게 된다.

        2. 사용자가 수신할 수 있는 메세지
        1) 점, 선, 면, 프로그램 종료 중에 하나를 선택하라
        2) 선택한 항목이 요구하는 값(좌표값, 원의 경우 반지름)을 입력하라
        3) 프로그램을 더 사용할지 말지 입력하라

        3. 프로그램이 수신할 수 있는 메세지
        1) 사용자가 선택한 메뉴에 따라 점, 선, 면 여부를 결정하라
        3-1. 점
        1)  좌표값을 출력하라
        3-2. 선
        1) 좌표값을 출력하라
        2) 길이값을 계산하여 출력하라
        3-3. 면(각 도형)
        1) 좌표값을 출력하라
        2) 둘레값을 계산하여 출력하라
        3) 넓이값을 계산하여 출력하라
        */


    }
}
